# PreDocEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PreDocEventArgs Class
Members See Also
---
The class is used as base class for the arguments of any pre-event arguments that is associated to a particular Document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PreDocEventArgs : PreEventArgs
```

Visual Basic
---
```text
Public Class PreDocEventArgs _
	Inherits PreEventArgs
```

Visual C++
---
```text
public ref class PreDocEventArgs : public PreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitEventArgs Autodesk.Revit.DB.Events..::..PreEventArgs Autodesk.Revit.DB.Events..::..PreDocEventArgs
# See Also
PreDocEventArgs Members
Autodesk.Revit.DB.Events Namespace